Revit 2027 API
ParameterTypeId.MaterialAspaint Property
 "As Paint"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId MaterialAspaint { get; }
Public Shared ReadOnly Property MaterialAspaint As ForgeTypeId
	Get
public:
static property ForgeTypeId^ MaterialAspaint {
	ForgeTypeId^ get ();
}
static member MaterialAspaint : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace